[
{
"name": "Sauti Sol",
"aka": "sauti_sol",
"type": "urban lingala and afrofusion",
"bio": "Sauti sol is a reknown kenyan band founded in 2007 by a group of four friends Bien, Chimano and the other two friends met after campus to start a band which has grown to become kenya's and east African largest music band winning music awards in africa and globally"
},
{
"name": "hart the band",
"aka": "hart_the_band",
"type": "urban lingala and Afrofusion",
"bio": "hart the band is a reknown kenyan band founded in 2012 by a group of three friends.The three friends met after campus to start a band which has grown to become one of Kenya's and east African largest music bands winning music awards in kenya and East Africa."
},
{
"name": "Elani",
"aka": "elani",
"type": "urban lingala and afrofusion",
"bio": "Elani is a reknown kenyan band founded in 2008 by a group of three friends.Maureen, Jackson and Wamboi met after campus to start a band which has grown to become one of Kenya's and east African largest music band winning music awards in kenya, and Africa"
},
{
"name": "PUnit",
"aka": "p_unit",
"type": "urban music",
"bio": "p_unit is a reknown kenyan and one of the oldest bands founded in 2006 by a group of three friends.The three friends came together to start a band which has grown to become one of Kenya's and east African largest music band winning music awards in kenya, and east Africa"
},
{
"name": "The counsol",
"aka": "the_counsol",
"type": "urban lingala and afrofusion",
"bio": "The counsol is a reknown kenyan music group founded in 2006 by a group of four friends. Mejja, Mantrax and two other friends came together to start a band which has grown to become one of kenya's and East African largest music band winning music awards in Kenya"
},
{
"name": "Kalif Jone",
"aka": "kaligraph",
"type": "urban hiphop rap lingala and afrofusion",
"bio": "Kalligraph is a reknown kenyan hiphop artist who started his music career back in 2009. kaligraph who is known for his high energy rap started started as a small artist and grew to become one of the major single music artist in kenya producing single hits and collabos."
},
{
"name": "King Kaka",
"aka": "rabbit",
"type": "urban poetic hiphop rap lingala and afrofusion",
"bio": "King kaka is a reknown kenyan hiphop artist who started his music career back in 2009.king kaka who is known for his poetic rap started started as a small artist and grew to become one of the major single music artist in kenya producing single hits and collabos."

},
{
"name": "Octopizzo",
"aka": "octopizzo",
"type": "urban hiphop rap lingala and afrofusion",
"bio": "Octopizzo is a reknown kenyan hiphop artist who started his music career back in 2009. Octopizzo who is known for his high energy rap started started as a small artist and grew to become one of the major single music artist in kenya producing single hits and collabos"
}
]