[
{
"date": "june 7, 2016",
"name": "Art Festival",
"venue": "Brew Bistro Lounge",
"entry": "$10",
"Description": "Come and enjoy a one in a life time event featuring your favourite artist such Kaligraph Jone, Sauti sol, elani and rabit.The show will be graced by a young talented upcoming artist kenrazy.You will also be served a bottle of guiness for free courtacy of eabl."
},
{
"date": "june 9, 2016",
"name": "Ebony Turns",
"venue": "Top of KICC",
"entry": "$15",
"Description": "Come party at the top of the most iconic building in the country with a wider view to the capital city.Performing in the party be the talented group of hart the band accompanied by King kaka and avrill. You will also be entertained by the creative comedian Chipukizi. "
},
{
"date": "june 15, 2016",
"name": "Go Down",
"venue": "Top of Hilton",
"entry": "$10",
"Description": "Come party at the top of one of the tallest building in nairobi located right at the CBD.Performing in the party will be the talented Octopizzo alongside R-Jay. You will also be entertained by the creative comedian Njoro."
},
{
"date": "june 20, 2016",
"name": "Beach Party",
"venue": "Mombasa",
"entry": "$15",
"Description": "Come enjoy the beach life while partying with beautifull ladies.Dressing code strictly Bikiny for ladies and beach wear for men.Performing in the party will be the talented Rich Mavoko from tanzania alongside susumila. You will also be entertained by the creative comedian Owago Nyiro. "
},
{
"date": "june 30, 2016",
"name": "Saturday Hungout",
"venue": "Tribeka",
"entry": "$5",
"Description": "Come say goodbye to being broke and welcome the new month in style.The party will feature kenya's best DJ Joe Mfalme alongliside talented artists such as victoria kimani and Prezzo. You will also be entertained by the creative comedian Chipukizi."
},
{
"date": "july 6, 2016",
"name": "Safaricom Jazz",
"venue": "Canivore",
"entry": "$1",
"Description": "Come enjoy smooth jazz from world's top jazz artists, for a subsequent member you safaricom_jazz do not dissapoint.Performing in the party will be the talented Aron rimbui alogside top jazz artists. You will only need a sh.100 worth of credit for entry courtacy of safaricom."
},
{
"date": "july 8, 2016",
"name": "Blankets and Wine",
"venue": "Aboratum",
"entry": "$10",
"Description": "Our fans know that wine and blankets dont dissapoint.This year's party will include all genres of music ranging from rumba to hip hop so we will have every one covered. We also intend to incorporote international dishes in our menu including indian and chinese."
},
{
"date": "july 12, 2016",
"name": "Koroga Festival",
"venue": "Aboratum",
"entry": "$13",
"Description": "Koroga festival is new, bigger and better especially for rumba and afrofusion lovers.This year's party will include all genres of music ranging from rumba to hip hop so we will have every one covered. Come enjoy local dishes such as githeri omena, mbuta, mukimo and many more while onjoying great music from east and central Africa."
},
{
"date": "july 16, 2016",
"name": "Meet and Mingle",
"venue": "Kempisky",
"entry": "$20",
"Description": "Are you ready to meet new people and mingle? Are you looking for a social partner?. Then Kempisky Vilarosa is the right place to be on 16th where you will meet singles like you ready to mingle. Dressing code is strictly red dress for ladies and official wear for men."
},
{
"date": "july 17, 2016",
"name": "Rock Party",
"venue": "Sarit Center",
"entry": "$10",
"Description": "Do you feel like scratching your small intestines.Are you the kind of person who drives range rover to a thatched-roof hut. At rock party we accomodate that kind of weirdness, dont worry about coming alone you will meet your kind of people here."
},
{
"date": "july 23, 2016",
"name": "Luo Festival",
"venue": "Canivore",
"entry": "Regular:$10 VIP:$20",
"Description": "Luo festival is new, bigger and better especially for Ohangla and Rumba lovers.This year's party will include all genres of music ranging from ohangla to rumba so we will have every one covered. Come enjoy local luo dishes such as omena, mbuta, and many more while onjoying great music from artists like John Junior, Akothe, Osoga Winyo among others, This year's show will be graced with comedians like Erick Omondi, Chipukizi, and Owago Nyiro."
},
{
"date": "july 21, 2016",
"name": "Kids Festival",
"venue": "Impala Grounds",
"entry": "$5",
"Description": "Bring your kids for a once in a life time event which will feature various comedians like Chipukizi, Churchil, Erick Omondi among others.This year's party will include various kids games together with recreational facilities like bouncing castle. the show will also include various kids foods like ice cream together with face painting services. Registered kids will have a chance to participate in games where they will be awarded as per their performance."
}
]